emacs_blog.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-01-22 Fri 22:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>使用org-mode写blog</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="./css/org-css.css"/>
<link rel="stylesheet" type="text/css" href="./css/gitalk.css"/></head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">使用org-mode写blog</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org38eccd7">1. 介绍org-mode</a></li>
<li><a href="#orgf726686">2. markdown的写作模式</a></li>
<li><a href="#orgd28197a">3. 配置orgmode</a></li>
<li><a href="#org9ad70e9">4. 参考资料</a></li>
</ul>
</div>
</div>

<div id="outline-container-org38eccd7" class="outline-2">
<h2 id="org38eccd7"><span class="section-number-2">1</span> 介绍org-mode</h2>
<div class="outline-text-2" id="text-1">
<p>
orgmode是emacs的一个插件，对于写作有非常好的体验。而且非常强大，实时渲染，日程管理，支持导出pdf，html等多种格式，日期，TODO，表格等操作十分方便，只有你想不到，没有做不到,HAHA。
</p>
</div>
</div>

<div id="outline-container-orgf726686" class="outline-2">
<h2 id="orgf726686"><span class="section-number-2">2</span> markdown的写作模式</h2>
<div class="outline-text-2" id="text-2">
<p>
以前也使用过markdown的方式写过blog，开始的时候觉得很新鲜，但是对于体验来说并不能让我很专心的写作。很多markdown工具实时渲染需要新开一个标签。我需要一边写文字一边照顾样式，而且写作窗口不能占据我所有的视野，很是别扭。直到我遇到emacs，从而遇到orgmode，才真正的觉得写作是一件比较舒服的事情。
</p>
</div>
</div>

<div id="outline-container-orgd28197a" class="outline-2">
<h2 id="orgd28197a"><span class="section-number-2">3</span> 配置orgmode</h2>
<div class="outline-text-2" id="text-3">
<p>
要使用orgmode写blog，还是需要一定的符合个人的配置，也需要css对导出的html进行一些美化, 下面是我配置的地方.(我使用的是spacemacs)
</p>
<ol class="org-ol">
<li>开启org layer</li>
</ol>
<p>
在spacemacs中使用orgmode需要在spacemacs的配置文件中开启org layer
</p>
<div class="org-src-container">
<pre class="src src-elisp">dotspacemacs-configuration-layers '(org) 
</pre>
</div>

<ol class="org-ol">
<li>设置org-publish-project-alist</li>
</ol>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #89DDFF;">setq</span> org-publish-project-alist
        '(
          <span style="color: #676E95;">;; </span><span style="color: #676E95;">... add all the components here (see below)...</span>
          (<span style="color: #c3e88d;">"org-notes"</span>
           <span style="color: #82aaff;">:base-directory</span> <span style="color: #c3e88d;">"~/guidao.github.io/org/"</span> <span style="color: #676E95;">;</span><span style="color: #676E95;">org&#25991;&#20214;&#30340;&#30446;&#24405;</span>
           <span style="color: #82aaff;">:base-extension</span> <span style="color: #c3e88d;">"org"</span> <span style="color: #676E95;">;</span><span style="color: #676E95;">&#25193;&#23637;&#21517;</span>
           <span style="color: #82aaff;">:publishing-directory</span> <span style="color: #c3e88d;">"~/guidao.github.io/"</span> <span style="color: #676E95;">;</span><span style="color: #676E95;">&#23548;&#20986;&#30446;&#24405;</span>
           <span style="color: #82aaff;">:html-head</span> <span style="color: #c3e88d;">"&lt;link rel=\"stylesheet\" type=\"text/css\" href=\"./css/org-css.css\"/&gt;"</span><span style="color: #676E95;">;</span><span style="color: #676E95;">&#33258;&#23450;&#20041;&#26679;&#24335;</span>
           <span style="color: #82aaff;">:recursive</span> t
           <span style="color: #82aaff;">:publishing-function</span> org-html-publish-to-html
           <span style="color: #82aaff;">:headline-levels</span> 4             <span style="color: #676E95;">; </span><span style="color: #676E95;">Just the default for this project.</span>
           <span style="color: #82aaff;">:auto-preamble</span> t
           <span style="color: #82aaff;">:timestamp</span> nil
           <span style="color: #82aaff;">:author</span> nil
           )
          (<span style="color: #c3e88d;">"org"</span> <span style="color: #82aaff;">:components</span> (<span style="color: #c3e88d;">"org-notes"</span>))
          ))

(<span style="color: #89DDFF;">setq</span> org-html-validation-link nil) <span style="color: #676E95;">; </span><span style="color: #676E95;">&#21435;&#25481;validation&#26174;&#31034;</span>
(<span style="color: #89DDFF;">setq</span> org-html-link-home <span style="color: #c3e88d;">"index.html"</span>)<span style="color: #676E95;">; </span><span style="color: #676E95;">&#35774;&#32622;home&#36229;&#38142;&#25509;</span>
(<span style="color: #89DDFF;">setq</span> org-html-link-up <span style="color: #c3e88d;">"index.html"</span>)
</pre>
</div>
<p>
我是把guidao.github.io/org/目录的文件导出到guidao.github.io/下,在guidao.github.io下会有org文件的同名的html格式的文件，之所以我把org也放在github上，是因为我工作跟家里使用两台不同的电脑，需要在两个地方进行修改。
</p>

<p>
现在可以执行命令 <code>M-x org-publish</code> 选择org导出文件了。但是blog一般来说需要一个首页对所有文件进行汇总。目前这个功能是手动进行.在org目录想创建一个index.org文件，贴上下面内容:
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #8d92af;">#+OPTIONS: TOC:nil ;&#20851;&#38381;&#30446;&#24405;</span>
<span style="color: #8d92af;">#+OPTIONS: NUM:nil ;&#20851;&#38381;&#26631;&#39064;&#21069;&#38754;&#30340;&#25968;&#23383;</span>
<span style="color: #8d92af;">#+OPTIONS: AUTHOR:nil ;&#19981;&#26174;&#31034;&#20316;&#32773;</span>
<span style="color: #8d92af;">#+OPTIONS: TIMESTAMP:nil ;&#19981;&#26174;&#31034;&#21019;&#24314;&#26102;&#38388;</span>

 * 2016&#24180;8&#26376; 
- <span style="color: #c792ea; font-weight: bold; text-decoration: underline;"><a href="file:xxx.org">xxx</a></span>
</pre>
</div>
<p>
然后就可以看见跟我一样的首页了。
</p>
</div>
</div>

<div id="outline-container-org9ad70e9" class="outline-2">
<h2 id="org9ad70e9"><span class="section-number-2">4</span> 参考资料</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="http://dayigu.github.io/WhyUseOrgModeToWriteBlog.html">http://dayigu.github.io/WhyUseOrgModeToWriteBlog.html</a></li>
<li><a href="http://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html">http://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html</a></li>
<li><a href="http://wiki.houye.xyz/blogwithorg-mode.html">http://wiki.houye.xyz/blogwithorg-mode.html</a></li>
</ul>
<p>
有兴趣的可以一起交流交流
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="gitalk" /> <script> var gitalk = new Gitalk({
  clientID: 'f30e66bb5ab9089aa742',
  clientSecret: '5d256d445447bd4db16540c2aab0e0884218ed12',
  repo: 'guidao.github.io',
  owner: 'guidao',
  admin: ['guidao'],
  id: 'gitalk',      // Ensure uniqueness and length less than 50
  distractionFreeMode: false  // Facebook-like distraction free mode
})
gitalk.render('gitalk') </script>
</div>
</body>
</html>
